Revit 2027 API
CurveByPointsArray.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Insert(
	CurveByPoints item,
	int index
)
Public Overridable Sub Insert (
	item As CurveByPoints,
	index As Integer
)
public:
virtual void Insert(
	CurveByPoints^ item,
	int index
)
abstract Insert :
        item : CurveByPoints *
        index : int -> unit
override Insert :
        item : CurveByPoints *
        index : int -> unit
Parameters
item CurveByPoints
index Int32
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace